#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/ittechlearning/Testing-Production-Public-AWS-VPC/runs/run-JKyQ8U1qFRQnLnQy

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.TestProd_IGW will be created
  + resource "aws_internet_gateway" "TestProd_IGW" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "TestProdPublic_IGW"
        }
      + tags_all = {
          + "Name" = "TestProdPublic_IGW"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route.TestProdPublic_Management_Bckup_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Management_Bckup_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Management_Pri_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Management_Pri_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Public_Bckup_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Public_Bckup_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.TestProdPublic_Public_Pri_Default_Route_Outbound will be created
  + resource "aws_route" "TestProdPublic_Public_Pri_Default_Route_Outbound" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.TestProdPublic_DMZ_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_DMZ_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_DMZ_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_DMZ_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_DMZ_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_DMZ_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_DMZ_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_DMZ_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Management_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Management_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Management_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Management_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Management_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Management_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Management_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Management_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Private_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Private_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Private_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Private_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Private_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Private_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Private_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Private_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Public_Bckup_RT will be created
  + resource "aws_route_table" "TestProdPublic_Public_Bckup_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Public_Bckup_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Public_Bckup_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.TestProdPublic_Public_Pri_RT will be created
  + resource "aws_route_table" "TestProdPublic_Public_Pri_RT" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "TestProdPublic_Public_Pri_RT"
        }
      + tags_all         = {
          + "Name" = "TestProdPublic_Public_Pri_RT"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_DMZ_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_DMZ_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_DMZ_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_DMZ_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Management_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Management_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Management_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Management_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Private_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Private_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Private_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Private_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Public_Bckup will be created
  + resource "aws_route_table_association" "TestProdPublic_Public_Bckup" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.TestProdPublic_Public_Pri will be created
  + resource "aws_route_table_association" "TestProdPublic_Public_Pri" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.TestProdPublic_DMZ_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_DMZ_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.7.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_DMZ_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_DMZ_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_DMZ_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_DMZ_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_DMZ_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_DMZ_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Management_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Management_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Management_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Management_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Management_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Management_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Management_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Management_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Private_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Private_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Private_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Private_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Private_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Private_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Private_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Public_Bckup_us-east-2b will be created
  + resource "aws_subnet" "TestProdPublic_Public_Bckup_us-east-2b" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Public_Bckup_us-east-2b"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Public_Bckup_us-east-2b"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.TestProdPublic_Public_Pri_us-east-2a will be created
  + resource "aws_subnet" "TestProdPublic_Public_Pri_us-east-2a" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "192.168.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "TestProdPublic_Public_Pri_us-east-2a"
        }
      + tags_all                                       = {
          + "Name" = "TestProdPublic_Public_Pri_us-east-2a"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.TestProdPublic_VPC will be created
  + resource "aws_vpc" "TestProdPublic_VPC" {
      + arn                                  = (known after apply)
      + cidr_block                           = "192.168.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "TestProdPublic_VPC"
        }
      + tags_all                             = {
          + "Name" = "TestProdPublic_VPC"
        }
    }

Plan: 30 to add, 0 to change, 0 to destroy.


```

</details>

*Pushed by: @drobinson-cl, Action: `pull_request`*